//Даны два числа. Показать большее и меньшее число

int numberA = 203;
int numberB = 33;

if (numberA > numberB)
{
    Console.Write("Большее число "); Console.WriteLine(numberA);
    Console.WriteLine("and");
    Console.Write("Меньшее число "); Console.Write(numberB);
}
else 
{
    Console.Write("Большее число "); Console.WriteLine(numberB);
    Console.WriteLine("and");
    Console.Write("Меньшее число "); Console.Write(numberA);
}